ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_sec_eng.c
/** @defgroup  SEC_ENG_Global_Variables
 *  @{
 */

/*@} end of group SEC_ENG_Global_Variables */

/** @defgroup  SEC_ENG_Private_Fun_Declaration
 *  @{
 */

/*@} end of group SEC_ENG_Private_Fun_Declaration */

/** @defgroup  SEC_ENG_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  SHA256 initialization function
 *
 * @param  shaCtx: SHA256 context pointer
 * @param  shaNo: SHA ID type
 * @param  shaType: SHA type
 * @param  shaTmpBuf[16]: SHA temp buffer for store data that is less than 64 bytes
 * @param  padding[16]: SHA padding buffer for store padding data
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_SHA256_Init(SEC_Eng_SHA256_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, SEC_ENG_SHA_Type shaType, uint32_t shaTmpBuf[16], uint32_t padding[16])
{
    uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));
    CHECK_PARAM(IS_SEC_ENG_SHA_TYPE(shaType));

    /* Deal SHA control register to set SHA mode */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);

    if (shaType < 8) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE_EXT, 0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE, shaType);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE_EXT, shaType - 7);
    }

    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

    /* Clear context */
    ARCH_MemSet(shaCtx, 0, sizeof(SEC_Eng_SHA256_Ctx));

    /* Init temp buffer and padding buffer */
    shaCtx->shaBuf = shaTmpBuf;
    shaCtx->shaPadding = padding;
    ARCH_MemSet(shaCtx->shaPadding, 0, 64);
    ARCH_MemSet(shaCtx->shaPadding, 0x80, 1);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(SEC_ENG_ID0_SHA_AES_TRNG_PKA_GMAC_IRQn, SEC_SHA_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  SHA512 initialization function
 *
 * @param  shaCtx: SHA512 context pointer
 * @param  shaNo: SHA ID type
 * @param  shaType: SHA type
 * @param  shaTmpBuf[16]: SHA temp buffer for store data that is less that 128 bytes
 * @param  padding[16]: SHA padding buffer for store padding data
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_SHA512_Init(SEC_Eng_SHA512_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, SEC_ENG_SHA_Type shaType, uint64_t shaTmpBuf[16], uint64_t padding[16])
{
    uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));
    CHECK_PARAM(IS_SEC_ENG_SHA_TYPE(shaType));

    /* Deal SHA control register to set SHA mode */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);

    if (shaType < 8) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE_EXT, 0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE, shaType);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE_EXT, shaType - 7);
    }

    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

    /* Clear context */
    ARCH_MemSet(shaCtx, 0, sizeof(SEC_Eng_SHA512_Ctx));

    /* Init temp buffer and padding buffer */
    shaCtx->shaBuf = shaTmpBuf;
    shaCtx->shaPadding = padding;
    ARCH_MemSet(shaCtx->shaPadding, 0, 128);
    ARCH_MemSet(shaCtx->shaPadding, 0x80, 1);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(SEC_ENG_ID0_SHA_AES_TRNG_PKA_GMAC_IRQn, SEC_SHA_IRQHandler);
    Interrupt_Handler_Register(SEC_ENG_ID1_SHA_AES_TRNG_PKA_GMAC_IRQn, SEC_SHA_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  MD5 initialization function
 *
 * @param  md5Ctx: MD5 context pointer
 * @param  shaNo: SHA ID type
 * @param  shaType: SHA type
 * @param  md5TmpBuf[16]: MD5 temp buffer for store data that is less that 64 bytes
 * @param  padding[16]: MD5 padding buffer for store padding data
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_MD5_Init(SEC_Eng_MD5_Ctx *md5Ctx, SEC_ENG_SHA_ID_Type shaNo, SEC_ENG_SHA_Type shaType, uint32_t md5TmpBuf[16], uint32_t padding[16])
{
    uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));
    CHECK_PARAM(IS_SEC_ENG_SHA_TYPE(shaType));

    /* Deal SHA control register to set SHA mode */
    tmpVal = BL_RD_REG(SHAx, SEC_ENG_SE_SHA_CTRL);

    if (shaType < 8) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE_EXT, 0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE, shaType);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SEC_ENG_SE_SHA_MODE_EXT, shaType - 7);
    }

    BL_WR_REG(SHAx, SEC_ENG_SE_SHA_CTRL, tmpVal);

    /* Clear context */
    ARCH_MemSet(md5Ctx, 0, sizeof(SEC_Eng_MD5_Ctx));

    /* Init temp buffer and padding buffer */
    md5Ctx->md5Buf = md5TmpBuf;
    md5Ctx->md5Padding = padding;
    ARCH_MemSet(md5Ctx->md5Padding, 0, 64);
    ARCH_MemSet(md5Ctx->md5Padding, 0x80, 1);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(SEC_ENG_ID0_SHA_AES_TRNG_PKA_GMAC_IRQn, SEC_SHA_IRQHandler);
    Interrupt_Handler_Register(SEC_ENG_ID1_SHA_AES_TRNG_PKA_GMAC_IRQn, SEC_SHA_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  SHA start function
 *
 * @param  shaNo: SHA ID type
 *
 * @return None
 *
*******************************************************************************/
void Sec_Eng_SHA_Start(SEC_ENG_SHA_ID_Type shaNo)
{
    uint32_t SHAx = SEC_ENG_BASE + SEC_ENG_SHA_OFFSET;
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_SEC_ENG_SHA_ID_TYPE(shaNo));

